package student_valerija_ionova.lesson_3.day_1.Task_1_6;

/*Создайте класс робот (Robot).

Научите вашего робота "говорить" привет.

Создайте в классе Robot метод со следующей сигнатурой:

    public void sayHello() {
        // тут напишите команду распечатки на консоли строки "Hello!"

        Task2
        В классе робот (Robot) создайте конструктор без параметров:
        public Robot() {  }
        Task5
        Создайте в классе Robot метод со следующей сигнатурой:
        public void sayYourName() {
        // тут напишите команду распечатки на консоли строки "My name is ROBO"
    }
    }*/

public class Robot {

    public Robot() {

    }

        public void sayHello() {
            System.out.println("Hello!");
        }
        public void sayYourName(){
        System.out.println("My name is ROBO");
        }
}
