package student_valerija_ionova.lesson_2.homeworks.day5;

//15 Найти в интернете как выводить на консоль строки без перевода курсора на новую строку.
//Написать программу, которая демонстрирует это.

public class Task15 {
    public static void main(String[] args) {
        System.out.print("Эта великолепная программа демонстрирует ");
        System.out.print("как выводить строки без перевода курсора на новую строку");
    }
}
