package student_roberts_kupcs.lesson_5.homework.level_3;

//Найдите логическую ошибку в программе и исправить её:
//
//class ForLoopDefinition4 {
//
//    public static void main(String[] args) {
//        for (int i = 0; i < 10; i--) {
//            System.out.println(i);
//        }
//    }
//
//}
//

//PS: программа должна выводить на консоль числа от 0 до 9.

//  i--  /  i++
class ForLoopDefinition4 {
    public static void main(String[] args) {
        for (int i = 0; i < 10; i++) {
            System.out.println(i);
        }
    }
}
