package student_anvars_intezars.home_tasks.lesson_2.day4;

public class Task13CompileCodeWithJavac {

    /* Как откомпилировать код с помощью JDK компилятора javac,
       без помощи среды разработки (из консоли)?

       Для компиляции исходного кода в байт-код, существтует компилятор
       "javac", входящий поставку JDK.
       На вход компилятор принимает файл с расширением ".Java",
       который содержит исходный код программы, а на выходе файл с
       расширением ".class", содержащий бакйт-код, который необходим для
       исполнения программы JVM.
       Сам код можно откопмилировать при помощи командной строки в терминале.
       Например, javac - d bin src/ru/javarush/Calculator.java.
       Однако здесь также используется дополнительная опция компилятора - d bin.
       Данная опция соединяет все файлы в директорию bin со структурой, которая
       аналогична src.
       Главный элемент компиляции это Javac - он и есть тот самый компилятор,
       который запускается в командной строке:
       javac<name of the file>

       Использованный источник:
       https://javarush.ru/groups/posts/2256-kompiljacija-i-ispolnenie-java-prilozheniy-pod-kapotom

     */
}
