package student_roberts_kupcs.lesson_2.homeworks.day_x.task_5;

class Comments {
    public static void main(String[] args) {
        /*  текст  */
        /* Компилятор игнорирует все от / * до * /.   */

        //текст
        // Компилятор игнорирует все от // до конца строки.

        /** документация */
        /**Это комментарий к документации и в целом его называют комментарием к документу .
         * Инструмент JDK Javadoc использует комментарии к документам при подготовке автоматически
         * сгенерированной документации.
         */
    }
}
