package student_alexey_tretyakov.lesson_3.day_1.Task_1_6;
/* Task_1
Создайте класс робот (Robot).

Научите вашего робота "говорить" привет.

Создайте в классе Robot метод со следующей сигнатурой:

    public void sayHello() {
        // тут напишите команду распечатки на консоли строки "Hello!"
    }
 */
public class Robot {

     public void sayHello(){
          System.out.println(" Hello! ");
     }

     /* Task_2
     В классе робот (Robot) создайте конструктор без параметров:
      */
     public Robot() {}

     /* Task_4
     Создайте в классе Robot метод со следующей сигнатурой:

    public void sayYourName() {
        // тут напишите команду распечатки на консоли строки "My name is ROBO"
    }
      */
     public void sayYourName() {
          System.out.print("My name is ROBO");
     }

}
