package student_volodya_danilin.lesson_2;

//Найти в интернете как выводить на консоль строки без перевода курсора на новую строку.
//Написать программу, которая демонстрирует это.

public class Lesson2_Task15 {
    public static void main(String[] args){
        System.out.print("first print! ");
        System.out.print("second print! ");
        System.out.print("third print! ");
    }
}
