package student_anvars_intezars.home_tasks.lesson_2.dayx;

public class Task4TypesOfProgrammingLanguages {

    /*
    Нетипизированные или бестиповые языки, как правило, это очень старые
    низкоуровневые языки, на которых программы являются набором машинных команд
    и пишутся, в основном, для взаимодействия с железом.

    Типизированные языки сделали разработку программ более осмысленной и эффективной.
    Этот факт оказался настолько весомым, что в основу всех современных языков легло
    такое фундаментальное понятие, как система типов. По причине того, что авторы пытались
    решить разные задачи, создаваемые ими языки стали различаться по типизации

    Java - строго типизированный объектно-ориентированный язык программирования,
    разработанный компанией Sun Microsystems (в последующем приобретённой компанией Oracle).

    Источники:
    https://nauchikus.gitlab.io/typescript-definitive-guide/book/contents/Экскурс%20в%20типизацию%20-%20Типизированные%20и%20нетипизированные%20языки%20программирования.html
    https://ru.wikipedia.org/wiki/Java

     */

}
