/*
Учимся работать со строками.

Тема: создание переменной типа String.

Напишите программу в которой создайте переменную
типа String и присвойте ей в качестве начального значения
ваше имя. Выведете на консоль значение этой переменной.

Пример кода:

    String myName = "Viktor";
    System.out.println(myName);
 */

package student_igors_bartkevics.lesson_3.homeworks.day_2;

public class Task_7 {

    public static void main(String[] args){

        String myName = "Igors";
        System.out.println(myName);

    }

}
