package student_volodya_danilin.lesson_8.level_2.Task_5;

public class Inheritance {

    /*
    Множественное наследование дает возможность создать класс,
    наследованный от нескольких суперклассов. В отличии от
    некоторых других популярных объектно-ориентированных языков
    программирования, таких как С++ в Java запрещено множественное
    наследование от классов.

    В Java множественное наследование не поддерживается в классах,
    но оно поддерживается в интерфейсах. И один интерфейс может
    расширять множество других интерфейсов.
     */
}
