package student_valerija_ionova.lesson_2.homeworks.day_x.super_task_5;

/*Напишите программу и продемонстрируйте в ней использование
однострочного и многострочного коментариев.*/

public class DataType {
    public static void main(String[] args) {
    /*типы данных в языке JAVA:
    DATA TYPE CATEGORIES
    ▸ Primitive values
        ▸ Integer: byte, short, int, long
        ▸ Fractional: float, double
        ▸ Logical: boolean
        ▸ Textual: char
    ▸ Reference values
        ▸ Everything else
     */
        System.out.println("Примеры типов данных в JAVA");

        //Теперь выводим на экран примеры, например тип данных для целых чисел

        System.out.println("int, например: 3, 50");

        //Пример дробных чисел

        System.out.println("double, например: 7.5");

        //Пример логического типа

        System.out.println("boolean, например true");

        //Пример символов

        System.out.println("char, например а");
    }

}
