package student_valerija_ionova.lesson_3.hometasks.day_1.task_1_6;

/*Создайте класс робот (Robot).

Создайте в классе Robot метод со следующей сигнатурой:

    public void sayHello() {
        // тут напишите команду распечатки на консоли строки "Hello!"

        Task5
        Создайте в классе Robot метод со следующей сигнатурой:
        public void sayYourName() {
        // тут напишите команду распечатки на консоли строки "My name is ROBO"
    }
    }*/

public class Robot {

        //Task2 В классе робот (Robot) создайте конструктор без параметров:
        public Robot() {

        }

        public void sayHello() {
            System.out.println("Hello!");
        }

        /*Task5
        Создайте в классе Robot метод со следующей сигнатурой:
        public void sayYourName() {
        // тут напишите команду распечатки на консоли строки "My name is ROBO"*/

        public void sayYourName(){
        System.out.println("My name is ROBO");
        }
}
