/*
Как вызвать конструктор родительского класса?
--------------------------------------------
Конструктор родительского класса вызывается при помощи ключевого слова super.
=============================================================================

Когда это нужно делать?
-----------------------
Это необходимо делать при определении конструктора дочернего класса
==============================================================================

Приведите пример кода.
 */
package student_igors_bartkevics.lesson_8.homework.level_2.task_7;

class ParentClass {
    private String fullName;

    public ParentClass(String fullName) {
        this.fullName = fullName;
    }
}
