package student_volodya_danilin.lesson_8.level_3.Task_10;

public class AbstractClass {
    /*
    Что такое абстрактный класс?
    Можно ли создать экземпляр абстрактного класса
    в момент выполнения программы?

    Абстрактный класс похож на обычный класс. В абстрактном классе также можно определить
    поля и методы, но в то же время нельзя создать объект или экземпляр абстрактного класса.
    Абстрактные классы призваны предоставлять базовый функционал для классов-наследников.
    А производные классы уже реализуют этот функционал.
     */
}
