package student_valerija_ionova.lesson_3.hometasks.day_2;

/*Учимся работать со строками.

Тема: создание переменной типа String.

Напишите программу в которой создайте переменную
типа String и присвойте ей в качестве начального значения
ваше имя. Выведете на консоль значение этой переменной.
    */

public class Task_7 {
    public static void main(String[] args) {
        String myName = "Valerija";
        System.out.println(myName);
    }
}
