package student_valerija_ionova.lesson_3.hometasks.day_2;

/*Учимся работать со строками.

Тема: Конкатенация строк.

Напишите программу в которой создайте переменную
типа String и присвойте ей в качестве начального значения
ваше имя. Выведете на консоль приветствие типа "Hi YourName".*/

public class Task_8 {
    public static void main(String[] args){

        String myName = "Valerija";
        System.out.println("Hi "+myName);

    }
}
