package student_volodya_danilin.lesson_8.level_2.Task_5;

import teacher.codereview.CodeReview;

@CodeReview(approved = true)
public class Inheritance {

    /*
    Множественное наследование дает возможность создать класс,
    наследованный от нескольких суперклассов.
    В Java запрещено множественное наследование от классов.

    В Java множественное наследование не поддерживается в классах,
    но оно поддерживается в интерфейсах. И один интерфейс может
    расширять множество других интерфейсов.
     */
}
